let wordList = ['аба','абажур','абзац','абонент','абордаж','аборт','абра','абрикос','абрис','абсурд','аванс','авантюрист','авария','аварцы','аверс','авиаль','авиатор','аво','авоська','авто','автобус','автограф','автол','автомат','автомобиль','автопортрет','автор','авторитет','ага','агат','агент','агу','ад','ада','адепт','адмирал','адрес','адресат','адъюнкт','ажиотаж','аз','азарт','азбука','азот','азу','азы','аи','аил','аир','аист','айва','айсберг','айсинг','айсор','академик','акан','акант','аккорд','аккордеон','акробат','аксиома','акт','актёр','актин','актиний','актриса','акула','акустика','акут','акцент','акциз','акция','акын','алабай','алгоритм','але','алет','алигарх','алкаш','аллегро','аллея','алмаз','алоэ','алтарь','алтын','алур','алфавит','альбом','альвеола','альгин','альт','альфа','алюминий','амбар','амбре','америций','амидол','амит','аммиак','аммоний','аммония','амок','ампер','амулет','амфитеатр','аналог','ангар','ангел','ангина','анемометр','анион','анкета','анна','анод','анона','аноним','анонс','антенна','антик','анчоус','аншеф','аониды','аорта','апаш','апе','апекс','апельсин','апилак','апорт','апостол','апостроф','аппарат','апперкот','аппетит','апсо','ар','ара','араб','арак','арап','арбитр','арбуз','арго','аргон','арена','аренда','арест','арии','аристократ','ария','арк','арка','артикль','артист','артистка','артрит','артроз','арфа','архив','арык','ас','аск','ассорти','ассоциация','астат','астра','асфальт','ат','атака','атеизм','атлет','атлетика','атмосфера','атолл','атом','аул','аура','аут','афера','афиша','ацетон','ашар','ашуг','аэд','аэропорт','аюга','аят','баба','бабочка','бабушка','багет','бадминтон','база','базар','бай','байка','байт','бак','бакалея','бакаут','бал','балабан','баланс','балбес','балда','балет','балка','балл','баллада','балласт','баллон','бальбоа','бампер','бан','банан','банда','бандероль','бандит','банк','банка','банкет','банкрот','бант','бань','баня','баобаб','бар','барабан','баран','баранина','баранка','бард','барда','бардак','барельеф','барий','барит','барка','барон','баррель','бархан','барьер','бас','басня','басок','басон','басс','бассейн','бат','батарея','батат','батва','батискаф','батон','бахрома','баян','бег','бега','бегемот','бегун','беда','беднота','бедро','бей','бейт','бек','бекас','бекон','бел','белена','бели','белка','белок','бельмо','берег','берёза','берет','берилл','бериллий','берклий','берлога','берш','бес','беседа','бест','бета','бетон','библиотека','библия','бива','бивень','бигуди','бид','бидон','билет','биллиард','бимс','бинокль','био','биография','бион','биота','биржа','бирюза','бирюк','бисер','бит','бита','битва','битьё','бич','благодарность','блайнд','блеск','блесна','блеф','близнец','близь','блог','блокнот','блюдо','бо','боа','боб','бобёр','бобо','бобслей','бог','богатырь','богач','бод','боди','боек','боец','божба','бозон','бой','бойи','бойкость','бойкот','бок','бокаж','бокал','бокс','боксёр','болван','болезнь','болт','боль','бом','бомба','бомж','бон','бона','бонд','бони','бонна','бонсай','бонус','боп','бор','боразол','борий','боро','борода','борозда','борт','борьба','босс','бот','бота','ботаник','бочка','боязнь','боян','бра','брак','браконьер','браслет','брат','брейк','бри','бригадир','бриз','бритва','бровь','брод','брокат','бром','бромид','броня','бросок','брус','брусок','брутто','брюки','будильник','буй','буйвол','бук','буква','буки','булка','бульдозер','бульон','бум','бумага','бунт','бур','бура','буран','бурда','буррито','буру','буря','бусы','бут','бутерброд','бутон','бутылка','буфер','буфет','бухта','буше','бхил','бык','быль','быр','быт','бытие','бэр','бюро','бюст','бюстгальтер','вага','вагина','вагон','вад','вади','ваер','ваза','ваи','ваия','вакса','вакуум','вал','валет','вали','вальс','валюта','вампир','ванадий','ваниль','ванна','вантуз','вар','варенье','варка','васаби','василёк','вата','ватрушка','ватт','ваучер','вафля','вахта','ваш','ваяо','введение','ввод','ввоз','вгон','вдова','вдох','вдохновение','ведение','веди','ведро','веер','веерник','вежа','вездеход','век','веко','вектор','великан','великость','величина','велюр','вена','венд','веник','вено','венок','вентиль','вепрь','вепс','вера','верба','верблюд','верп','версия','вертел','верх','вершина','вес','вескость','весна','вест','весть','весы','ветвь','ветер','ветка','вето','вех','веха','вече','вечер','вечеринка','вечность','веш','вещь','взгляд','вздор','вздох','взлёт','взнос','взор','взятка','виг','вид','видео','видеобар','визг','визит','вика','викторина','вилка','вилы','вина','винец','винил','вино','винт','винтик','вира','вираж','виртуоз','вис','виса','виска','виски','висмут','висок','вист','витраж','витье','вихор','вихорь','виши','вклад','вкладыш','включение','вкус','влага','власть','влёт','влияние','внимание','внук','вода','водка','водоём','водород','водь','воз','возок','возраст','воитель','вой','войлок','война','войт','вок','вокзал','вол','волк','волокно','волчок','вольт','вольфрам','воля','вона','вонь','вопрос','вор','воробей','ворона','ворот','ворота','воротник','ворох','ворс','воск','воспитание','восток','восторг','восход','вошь','вояж','впечатление','враг','вратарь','врач','вред','время','врио','всадник','всплеск','вспышка','вставка','вторжение','втулка','вулкан','вут','вуте','вход','въезд','выбор','вывес','вывеска','вывод','выговор','выгода','выдох','выдра','выдумка','выигрыш','выкат','выкуп','вылет','вымя','вынос','выпар','выпечка','выпуск','вырубка','выручка','выступ','выступление','высь','выход','вычет','вышка','выя','вьюга','вьюнок','вяз','вязка','вязкость','га','гавань','гад','гадолиний','гадость','гадюка','газ','газель','газета','гази','газон','гай','гайка','гак','гал','гала','галалит','галка','галлий','галоп','галоша','галстук','гам','гамак','гамбит','гамма','гар','гарантия','гарде','гармония','гармонь','гарнир','гаро','гаф','гафель','гафнии','гафний','гаял','гвалт','гвардия','гвид','гвоздика','гвоздь','гевея','гей','гейзер','гейм','гейша','гексамер','гелий','гем','ген','генерал','гений','георгин','герб','гербарий','герде','гердероб','германий','героиня','герой','герпес','герц','герцог','гетра','гетто','гжель','гиацинт','гибель','гибкость','гигиена','гид','гидрид','гидртринитрид','гиена','гиль','гимн','гимнаст','гимнастика','гимнастка','гипотеза','гипс','гиря','гит','гитара','глава','глагол','гладиолус','гладкость','глаз','глазурь','глас','глина','глобус','глотка','глоток','глупец','глюон','глянец','гнездо','гнёт','гной','гном','гну','гнус','го','гобой','говор','говядина','год','годе','гол','голова','голод','голос','голь','гольё','гольмий','гольф','гон','гонец','гонка','гонки','гончар','гора','горе','горечь','горилла','горло','горох','горсть','гортань','горчица','горькость','горючее','гость','гот','готика','граб','гравий','гравюра','град','градус','градусник','граммофон','грамота','гранат','граница','грань','граф','график','графин','грач','гребень','грёза','грек','грех','греча','гриб','грибок','грива','гривна','гриль','грим','гриф','грифель','гроб','гроза','гром','громкость','грош','груда','грудь','груз','грузовик','грунт','группа','грусть','груша','грядка','грязь','гу','гуакамоле','гуашь','губка','гудок','гуж','гуй','гул','гур','гусеница','гусыня','гусь','гуталин','гуща','гэта','давление','дайм','далия','даллия','дама','дан','дантист','дань','дао','дар','дармштадтий','дата','датчик','дача','дверь','двигатель','движение','двор','дворник','дебет','дебют','дева','девичник','девка','девочка','девушка','дёготь','дед','дедушка','дей','действие','дек','дека','деканат','декор','дело','дельта','день','денье','депеша','депо','деревня','дерево','дернорез','десерт','десна','деспот','деталь','детектив','детектор','детёныш','детка','детонатор','детство','дефект','деятель','джаз','джайв','джекпот','джем','дзета','дзэн','ди','диаграмма','диакон','диалог','диаметр','диборан','дива','диван','диез','диета','диетолог','дизайн','дизайнер','дикость','димер','диметилсульфат','дина','динамик','динамика','динамит','динар','диод','диоксид','диплом','диск','дискета','диско','дискотека','диспрозий','дистанция','дихромат','дичь','длина','дневник','днище','дно','до','добор','добро','добыча','доверие','довод','дог','догадка','договор','дож','дождевик','дождь','доза','дозор','док','дока','доказательство','доктор','документ','документация','дол','долгота','долма','долька','доля','дом','домен','дон','донатор','донг','донец','донор','допуск','дорога','доска','доставка','доступ','досуг','досье','доход','дочь','дояр','доярка','дравит','драга','драже','драйв','драйвер','драка','дракон','драма','дратва','драхма','древо','дрейф','дрель','дробь','дрова','дрожжи','дрожь','дрофа','друг','друз','дрын','дрянь','дуб','дубление','дубль','дубний','дуга','дудка','дузен','дуит','дукат','дуло','дума','дун','дуплон','дур','дура','дурак','дуралей','дух','духи','духовка','духота','душ','душка','дуэль','дуэт','дыба','дым','дымоход','дыня','дыра','дырка','дыхание','дыханье','дышло','дьявол','дьяк','дэ','дюжина','дюйм','дюк','дюшес','дядя','дятел','европий','егоза','еда','едкость','едок','ёж','ежа','ежевика','ёжик','ежонок','езда','ездок','ель','ёмкость','емь','ендова','енот','епископ','ер','ёрзание','ёрш','еры','ерь','ехидна','жаба','жабо','жабры','жавель','жад','жажда','жало','жалоба','жанр','жар','жарка','жбан','жвачка','жгут','же','жезл','желание','желе','железо','железобетон','жёлоб','желток','жёлудь','жёлчь','жемчуг','жена','женщина','жерло','жест','жестокость','жесть','жжение','живот','животное','жига','жидкость','жидомор','жижа','жизнь','жила','жилет','жилище','жильё','жим','жир','жираф','житель','житкость','жмурки','жо','жоао','жок','жокей','жом','жор','жук','жулик','жуткость','жуть','жыгач','жюльен','жюри','забег','забор','забота','завал','заведение','завет','завод','загар','заголовок','зад','задание','задаток','задача','заеда','заём','заёмщик','заика','заикание','заир','займ','заказ','закат','закон','зал','зала','залавок','залив','залог','залп','замена','заметка','замок','замша','замысел','занос','зануда','занятие','запад','запас','запаска','запах','запой','запор','запрет','запуск','запятая','зародыш','заря','заряд','зарядка','засада','засечка','застава','затея','затон','затор','затрата','затылок','зачатие','зачёт','защита','заявка','заяц','звание','звезда','зверь','зверюга','звон','звонкость','звонок','звук','звукооператор','зга','здание','зебу','зев','зевака','зевок','зевота','зелень','зело','зелье','зельц','землекоп','земля','земляк','зеркало','зерно','зеро','зет','зигзаг','зима','зира','злак','зло','злоба','злодей','злюка','змей','змея','знак','знамя','знание','знаток','знать','значение','зной','зоб','зов','зодчий','зола','золотадиборан','золотник','золото','зона','зонд','зонт','зоолог','зоопарк','зоркость','зрение','зритель','зуав','зуб','зубило','зубр','зуд','зум','зяблик','зять','ибис','ибо','ива','игла','иго','иголка','игра','игрец','игрок','игромания','игрушка','игуана','ид','идеал','идея','иджма','идиома','идиот','идо','идол','иды','иерархия','иже','ижица','изба','известие','изгиб','изгнание','издание','изложение','измена','износ','изо','изолятор','изоляция','изумруд','изъян','изъятие','изыск','икона','икота','икра','икс','икт','ил','ила','имбирь','имитация','имя','индекс','индиго','индий','индюк','иней','инжир','инка','инок','иностранец','инструктор','интим','инфанта','информатор','информация','инь','иняз','иод','иол','ион','ионит','иох','ипотека','ипсилон','иридий','ирис','ириска','ирония','иск','исключение','искра','искусство','испуг','испытание','иссоп','истец','истина','исток','историк','история','источник','истукан','исход','итерация','итог','иттербий','иттрий','июль','июнь','йена','йети','йог','йога','йогурт','йод','йодид','йодль','йот','йота','ка','кабак','кабан','кабаре','кабачок','кабель','кабина','каблук','кава','кадет','кадка','кадмий','кадр','кадык','кадь','казино','казна','казус','кай','кайф','кака','какао','кактус','кал','каланхоэ','калао','калач','календарь','календула','калибр','калий','калифорний','калькулятор','кальций','кам','камбала','каменоломня','камень','камера','камертон','камин','камыш','кан','кана','канал','канапе','канаус','канон','канопа','каноэ','кант','кантри','кап','капер','капилляр','капкан','капля','капор','капот','каппа','каприз','кар','кара','карамель','карандаш','караоке','карапуз','карась','карат','каратэ','каратэист','караул','карбид','карбонат','каре','карета','карма','карман','карп','карри','карры','карсет','карта','картина','картограф','картон','карусель','карцер','карьера','каска','касса','кассета','кастет','кастрюля','кат','каталог','катапульта','катастрофа','катер','катод','каток','катхак','катык','каф','кафа','кафе','кач','каша','кашель','кащей','каюк','каюта','ква','квадрат','квант','кварк','кварц','квас','квасцы','кеа','кег','кегля','кед','кедет','кейс','кекс','кен','кенгуру','кент','кепи','кепка','керамика','кёрлинг','керш','кеч','кеш','кивок','кий','кил','кила','кило','килобайт','километр','килоом','киль','кина','кинза','кино','кинотеатр','киоск','кип','кипа','кипарис','кир','кирасир','кирка','киса','кисель','кисея','кислород','кислота','кисточка','кисть','кит','кич','киче','кишечник','кишка','клавиатура','клавиша','клад','клан','клапан','класс','классик','классика','классицизм','клёв','клевер','клевета','клеёнка','клей','клейкость','клеймо','клён','клетка','клёст','клёш','клещ','клещи','клик','климат','клин','клич','клон','клоп','клоун','клоунада','клуб','клубника','клумба','клык','клюв','клюква','ключ','ключица','клюшка','клякса','кляп','кляр','книга','кнопка','кнут','князь','коала','коб','кобальт','кобо','кобол','кобольд','кобыла','ковбой','ковёр','ковш','ковы','коготь','код','кодак','кодекс','кожура','коза','козни','койка','койот','кок','кокаин','кокон','кокос','кокс','коктейль','кол','кола','колба','колбаса','колдун','колебание','колено','колесо','колея','количество','колка','коллега','колледж','коллектив','коллекция','колли','коло','колода','колодец','колокольчик','колонна','колос','колье','кольцо','ком','команда','командир','комар','комбинация','комедия','комета','коми','комментарий','коммерция','комод','комок','компания','комплекс','компот','комуз','кон','конверт','конга','конденсат','конец','коник','конина','конка','конкурс','конопля','конспект','конструктор','контакт','континент','конто','контракт','конура','конфета','конфетти','конфликт','концепция','концовка','конъюктура','конь','коньяк','конюх','конюшня','коп','копа','копёр','коперниций','копилка','копир','копр','копыто','кор','кора','корабль','коралл','корень','корзина','корка','корм','корма','кормушка','корова','король','коромысло','корона','корпус','корреспондент','корсет','корт','корь','коса','косарь','косатка','костёр','кость','косяк','кот','кота','котёнок','котлован','коттедж','кофе','кофеин','кофейник','кофемолка','кофта','коч','кочан','кочевник','кош','кошениль','кошка','кошмар','краб','кража','край','кран','крапива','краса','краска','краткость','крах','кредит','кредо','крем','кремний','креп','крепость','крест','криветка','крик','крикет','криптон','критик','критика','кров','кровать','кровь','крой','кройка','крокодил','крокус','кролик','кроль','крона','крор','кросс','кроссворд','крот','кроха','круассан','круг','кругозор','кружка','крупа','крыло','крыльцо','крыса','крыша','ксенон','кси','куб','кубик','кувшин','кувшинка','кузина','кузнец','кузнечик','кузов','кукла','кукушка','кулак','кулёк','кулич','кулон','кум','кумир','кунжут','купец','купол','купон','куратор','курица','куркума','курс','куртка','курьер','кусок','куст','кухня','куча','куш','куща','кыр','кыяк','кьят','кэп','кэт','кю','кюве','кювет','кювета','кюй','кюре','кюри','кюрий','лабиринт','лабрадор','лава','лаванда','лаваш','лавка','лавр','лаг','лага','лагерь','лад','ладонь','ладья','лаж','лаз','лазер','лай','лайка','лайм','лайнер','лак','лакей','лама','лампа','лан','лангуст','ландыш','лантан','лань','лао','лапа','лапоть','лапта','лапша','лар','ларго','лари','ласка','лассо','ласточка','лат','латунь','лауреат','лебедь','лев','левак','левит','лёгкость','лёд','ледерин','леди','ледник','леер','лежебока','лей','лейтенант','лек','лекало','лекарь','лектин','лектор','лекция','лемур','лён','ленивец','лентяй','лень','леоне','лепесток','лепёшка','лепта','лес','леса','леска','лесник','лесть','лёт','лето','летопись','летун','лётчик','лечение','лечо','лещ','лея','лжец','ли','лиард','ливень','ливерморий','ливр','лига','лидо','лик','ликод','лилия','лимит','лимон','лимонад','лимфа','линейка','линия','линь','лио','лион','липа','липкость','лира','лирика','лис','лиса','лист','листва','листок','лису','лит','литература','литий','литр','литфак','лиф','лифо','лифт','лифтёр','лифчик','лихо','лицо','лнеоничи','ло','лоа','лоб','лобстер','лов','ловец','ловкость','ловля','ловушка','логика','логово','логотип','лодка','лодырь','ложа','ложе','ложка','ложок','ложь','лозунг','локатор','локо','локоть','лом','ломтик','лоно','лопата','лопух','лор','лорд','лорел','лори','лосось','лось','лосьон','лот','лотерея','лото','лоток','лотос','лоуренсий','лох','лошадник','лошадь','луб','луг','лужа','лужайка','луза','лук','лука','лукошко','лун','луна','лунатик','лунда','луо','лупа','лур','лура','луры','лут','луч','лучник','лыжа','лыжня','лыко','лычка','львёнок','львица','льгота','лье','лэ','лэй','лэтуар','лэут','любовь','люверс','люк','люкс','люстра','лютик','лютня','люфт','ля','лямбда','лян','ляп','лясы','ма','маар','маг','магазин','магия','магнезия','магнетрон','магний','мажор','маз','мазок','мазь','май','майду','майка','майо','майолика','майонез','майор','мак','мака','макака','маки','мако','малина','малыш','маляр','мама','мамбо','ман','манап','манго','мания','манко','мано','манты','маньяк','маори','марал','марганец','маргаритка','марка','марля','март','маршрут','марь','мас','масса','массив','мастер','мастерство','масть','масштаб','мат','матадор','мате','математик','математика','материал','материк','материя','матрас','матрица','матч','маты','мать','маун','мах','махе','маца','мачеха','мачо','мачта','маш','машина','маэстро','маятник','мгла','мгновение','ме','мёд','медаль','медальон','медведь','медок','медь','межа','мейтнерий','мел','мелодия','мелон','мель','мельница','мена','менделевий','менеж','менуэт','меню','мера','мерк','мерка','меса','месть','месяц','металл','металлоискатель','метан','метанол','метафора','метель','метеор','метеорит','метис','метка','меткость','метла','метод','метр','мех','механик','механика','меч','мечеть','мечта','мечтание','мечтатель','мешок','ми','миг','мигание','миди','мидия','микрофон','мил','миледи','милиция','миль','миля','мим','мимика','мимоза','мина','минор','минус','минута','мир','мира','мираж','миро','мирт','миска','мисс','миссия','митинг','миф','мишень','мнение','множитель','мо','могила','могур','мода','модель','модельер','модуль','мозаика','мозг','мозоль','мойка','мойщик','мол','молва','молибден','моллюск','молния','молодец','молоко','молот','молоток','моль','мольба','момент','мон','монарх','монастырь','монета','монитор','моногерманий','монокль','монолог','монстр','монтаж','монтажёр','мопс','мор','мораль','морг','моргание','морда','мордаш','море','морж','мори','морковь','мороз','морозильник','морока','морс','морф','морфема','московий','мост','мот','мотет','мотив','моток','мотор','мотоцикл','мотоциклист','мотто','мох','мохур','моча','мочалка','мощи','мощь','мрак','мрамор','мститель','му','муадор','мудрец','муж','мужчина','муза','музыка','музыкант','мука','мул','мульк','муляж','мунгу','мундир','муравей','мускул','мускулатура','мусс','муссон','мутант','мутон','муть','муфта','муха','мухомор','муцин','мщение','мыло','мыс','мысль','мыт','мыто','мытьё','мышь','мышьяк','мэр','мю','мюид','мюон','мякоть','мяо','мясник','мясо','мясоед','мясорубка','мята','мяч','набат','набор','навес','навоз','навык','нагар','наглец','награда','нагрев','надежда','надзор','надрез','наезд','наездник','наив','най','найра','накал','накрит','нал','налог','намёк','нао','напор','направление','нар','нарезка','наречие','народ','нарост','нарцисс','нары','наряд','наследник','насморк','наст','наставник','настой','настрой','настройка','нат','натаска','натр','натрий','натюрморт','натяжка','наука','наци','начало','начинка','наш','нашатырь','ная','нгве','нёбо','невод','неволя','нега','негр','нед','недра','недуг','нейтрон','нектар','ненастье','неодим','неон','непер','нептуний','нерв','нервоз','неряха','несправедливость','несчастье','нетто','неуют','неф','нефрит','нефть','нива','низ','ник','никель','нимб','нимфа','ниобий','нит','нити','нитка','нитрат','нитрид','нить','нихоний','ноа','нобелий','новичок','новость','новь','нога','нож','ножницы','ноздря','ной','нок','нокаут','ноль','ном','нома','номер','номинал','нона','ноо','нора','нори','нория','норка','норма','норматив','норов','нос','носка','носок','носорог','нота','нотариус','нотка','ноты','ноубл','ночлег','ночник','ночь','ноша','нрав','нуг','нудо','нужда','нус','нут','нутро','нытьё','ньютон','нэцкэ','ню','нюанс','нюх','нянь','няня','оазис','обвал','обвес','обгон','обед','обечайка','обжа','обжора','оби','обивка','обида','обилие','облако','облачность','облик','облом','обман','обмен','обнова','обо','обод','обоз','обозначение','обои','обол','оборона','оборот','обояние','образ','обряд','обсидиан','обход','обшивка','общество','общник','объедок','объезд','объект','объектив','объём','объявление','объяснение','объятие','обыск','обычай','овал','овен','овёс','овин','овод','овощ','овраг','овца','овчарка','овы','оганесон','огарок','огласка','огонёк','огонь','огород','ограда','ода','одежда','одер','одеяло','однообразие','одр','ожидание','ожог','оз','озеро','озноб','озон','озонатор','океан','окись','оклад','оклик','окно','око','оков','окоп','окот','окраина','окрас','окрол','округ','оксалат','оксид','октава','октаво','октет','окулист','окунь','олень','олива','олигомер','олово','ом','омар','омег','омега','омела','омёт','омето','омикрон','омметр','омограф','омоним','омофон','омут','он','она','онёр','оникс','ончиа','опал','опера','оператор','операция','оперон','опий','оплата','опоек','опора','опоссум','опрос','опт','оптик','оптика','опус','опухоль','опыт','ор','оратор','орган','организм','орда','орден','ордер','орёл','орех','ори','ориентир','оркестр','орлан','орок','орт','ортофосфат','орудие','оружие','орхидея','оса','осада','осадка','осадок','осёк','осёл','осень','осётр','осина','осман','осмий','осмотр','особа','осока','осот','оспа','остановка','остов','остол','остриё','ость','ось','отара','отбой','отбор','отвар','отверстие','отвёртка','отвес','ответ','отвоз','отгадка','отгул','отделка','отдых','отель','отец','отжим','отзыв','отит','отказ','отклик','откос','открытие','открытка','отлив','отличие','отлов','отмена','отметка','отпад','отпечатка','отпечаток','отпор','отправитель','отправка','отправление','отпуск','отрава','отражение','отрез','отрезок','отсек','отставка','отстой','отступ','отсылка','оттенок','оттиск','отток','отход','отцеп','отчёт','отъезд','отъём','офис','офицер','охота','охотник','охра','охрана','охранник','оценка','оцет','очаг','очёс','очистка','очки','очко','ошибка','ощупь','па','паб','пава','павана','пагода','падеж','падение','паек','паж','паз','пазл','пай','пайка','пайол','пайр','пайса','пак','пакет','пал','палата','палач','палец','палка','палладий','палм','палуба','пальма','пальто','памятник','память','пан','панда','пани','панк','панно','пано','пантомима','пао','паоло','папа','пар','пара','парабола','параграф','парад','парадокс','паразит','парашют','парень','пари','парик','парк','паровоз','паром','пароход','парс','партер','партия','партнёр','парус','парусник','парфюм','парфюмерия','пас','паскаль','пасо','паспорт','пасс','пассажир','паста','пастух','пасть','пасха','пат','пате','патент','патер','патуа','пауза','паук','паутина','пах','паш','пашня','паяльник','пе','пеан','певец','певица','певун','педаль','педи','пежо','пей','пейзаж','пёк','пека','пекан','пекари','пекарня','пекарь','пекейс','пекло','пемза','пена','пенал','пенальти','пение','пенка','пенни','пенс','пень','пеон','пепел','пепельница','перебор','перевод','перед','передача','переделка','переиздание','перекличка','перекус','перелом','перемена','перенос','перерыв','перестрелка','пересчёт','переход','перец','перила','периметр','период','пёрка','перл','перо','пероксид','перс','персик','персона','персонаж','перст','перш','пёс','песета','песня','песо','песок','пест','песь','петля','петрушка','петуния','петух','печаль','печать','печь','пешка','пещера','пещур','пи','пианино','пиастр','пивбар','пиво','пивовар','пиджак','пижама','пик','пика','пикан','пике','пики','пикша','пила','пилон','пилот','пим','пино','пион','пионер','пипа','пир','пирамида','пират','пирит','пирог','пирожок','писец','писк','пистолет','письмо','пита','питание','питон','питьё','пихта','пища','пищание','плагин','плак','плакат','план','планер','планёрка','планета','планка','планшет','пласт','пластмасса','плата','платина','плато','платок','платье','плафон','плач','плащ','плед','племя','плен','плёнка','пленник','плёс','плеск','плечо','плинтус','плис','плов','плод','пломба','пломбир','плоскость','плот','плотник','площадка','площадь','плуг','плут','плутоний','плюс','плюш','плющ','пляс','пляска','пляш','побег','победа','повар','повесть','повод','повозка','повтор','погода','погон','погоня','под','подарок','подать','подача','подборка','подва','подвал','подвиг','подводка','подделка','поделка','подера','подир','подиум','подкова','подлёт','поднос','подпись','подруга','подсказка','подснежник','подсолнух','подстава','подсчёт','подушка','подход','подъезд','подъём','подъёмник','поединок','поезд','пожар','поза','позыв','поиск','пойло','пойнтер','показ','покой','поколение','покрывало','пол','поле','полёт','полив','полимер','полис','полиция','полиэфир','полк','полка','полночь','поло','полова','поломка','полоний','полоса','полотенце','полотно','полуфабрикат','получатель','поль','польза','полька','полюс','помада','помёт','помойка','помощь','помпа','понд','пони','понос','пончик','поп','поправка','популярность','попытка','пора','порез','порей','порог','порода','поросёнок','порох','порошок','порт','портал','портрет','поршень','порыв','порядок','посад','посадка','посев','посёлок','последствие','пособие','посол','посох','пост','постель','поступок','посуда','посыл','посылка','пот','пото','поток','потолок','потомок','потоп','потребитель','поход','походка','похоть','почва','почерк','почёт','починка','почка','почта','почтальон','пошив','поэзия','поэма','поэт','пояс','правда','правило','правитель','правка','право','праздник','празеодим','праотец','прах','прево','преграда','предел','предок','предсказание','предсказатель','презентация','президент','премия','премьера','прение','преподаватель','пресс','пресса','преступление','прибор','привет','прививка','привод','привычка','приговор','приезд','приём','приёмник','приз','признак','приказ','приказчик','прилив','примат','пример','примерка','примесь','примета','принтер','принц','принцесса','приор','припой','природа','присказка','прислуга','приставка','приток','прицеп','причёска','причина','приют','приятель','проба','пробег','пробел','пробка','проблема','провал','проверка','проводник','программа','прогресс','прогулка','продолжение','продукт','проезд','проект','проём','проза','прозвище','проигрыш','произведение','производство','пролан','прометий','пропан','пропуск','пророк','прорыв','просак','простота','пространство','проступок','просьба','протактиний','протей','протон','прототип','профан','профессор','профи','проход','процедура','процент','процесс','процессор','прошивка','проявка','проявление','пруд','пружина','прут','прыжок','прядь','пряжа','прятки','пряха','пси','псих','психиатр','психолог','психология','псоит','птенец','пти','птица','пуаз','пуант','публика','пуговица','пуд','пудель','пудинг','пудра','пузырёк','пузырь','пук','пул','пульт','пуля','пункт','пуп','пупок','пур','пури','пурпур','пус','пуск','пустота','пустыня','пустяк','пут','путник','путь','пуф','пуфик','пух','пушка','пуща','пфенинг','пчела','пшено','пыж','пыл','пыль','пыльца','пытка','пье','пьеса','пья','пэр','пюпитр','пюре','пядь','пясть','пята','пятак','пятачок','пятка','пятнашки','пятно','раб','раба','работа','равнина','рагу','рад','рада','радар','радий','радио','радон','радость','радуга','раек','раз','разбег','разведка','разветвление','развитие','развод','развязка','разговор','разгул','разлад','размазня','размер','разоблачение','разогрев','разок','разработка','разрыв','разряд','разум','разъезд','разъём','раи','раит','рай','район','рак','рака','ракета','ракушка','рама','рамка','рана','ранг','ранет','ранец','рант','ранчо','рань','рао','рапа','рапп','раритет','рас','распад','расписание','рассказ','рассказчик','расчёска','рататуй','рать','раунд','раут','рахит','рвач','рвота','ре','реал','реалист','реалия','ребёнок','ребро','ребус','рёв','рёва','ревун','ревю','регби','регистр','регистратура','регистрация','редактор','редакция','редкость','редут','редька','режиссёр','рез','резак','резерв','резерфордий','резина','резкость','резня','резонанс','резь','резьба','рей','рейв','рейд','рейс','рейтинг','рейх','река','реквизит','реклама','рекон','реле','рельс','рем','ремень','ремесленник','ремесло','ремикс','ремонт','рений','рено','ренонс','рента','рентген','рентгений','репа','реплика','реферат','рефлекс','реформа','рецепт','речь','решение','решка','рея','ржавчина','рига','ридер','риель','рил','ринит','рис','риск','рисунок','ритм','риф','рифма','рифт','риял','ро','робот','ров','рог','род','родан','родео','родий','родина','родня','роды','рожа','рожок','рожон','рожь','роза','розыгрыш','рой','рок','рол','ролик','ролл','роль','ром','роман','романтика','ромашка','ромб','рондо','роп','рос','роса','роскошь','рост','росток','рот','рота','роща','рояль','ртуть','рубанок','рубаха','рубашка','рубеж','рубидий','рубин','рубль','руд','руда','ружьё','руина','рука','рукав','рукопись','рукоятка','рулет','рулетка','руль','румба','руно','рупия','рупор','русалка','руспо','рутений','рутина','рутулец','ручей','ручка','рцы','рыба','рыбак','рыбалка','рывок','рык','рым','рында','рынок','рысак','рысь','рыцарь','рычаг','рэнд','рэп','рюмка','рюха','ряд','са','саам','саба','сабля','сабо','сага','сад','садик','сажа','саз','сайт','сак','саке','саки','салат','салка','сало','салон','салун','салфетка','сальса','сальто','салют','самарий','самбо','самец','самка','самовар','самогон','самокат','самолёт','самосвал','самострел','самотёк','самоцвет','самум','сан','сани','сап','сапёр','сапог','сапфир','сар','сара','сарай','сат','сати','сатура','сах','саше','сая','сбережение','сбой','сбор','сборка','сборник','сборщик','сбыт','свадьба','свал','свалка','сван','сват','свежесть','свёкла','свекровь','свес','свет','светильник','светофор','свеча','свидание','свидетель','свинец','свинья','свист','свисток','свита','свитер','свищ','свобода','свод','своз','свояк','связка','сгиб','сгон','сдача','сдоба','сеанс','сев','север','севр','сед','седи','седло','седок','сейф','секвойя','секрет','секс','секта','сектор','секунда','секундант','секция','селезень','селен','село','сель','сельдь','семья','семя','сен','сенжи','сени','сенити','сенна','сено','сеновал','сень','сера','серб','сервер','сервис','сердце','серебро','серена','серин','серия','сероуглерод','серьга','сесино','сестра','сет','сетка','сеть','си','сиборгий','сивка','сиг','сигма','сигнал','сид','сиделка','сидение','сила','сили','силикат','силос','силует','симфония','синева','синец','синица','синтез','синь','синька','синяк','сион','сип','сир','сирен','сирена','сирень','система','сит','сито','сиу','сиф','сифон','ска','сказка','скала','скандал','скандий','скат','скачки','сквош','скидка','складка','склеп','склон','склонение','скоба','скобарь','скоец','скол','скорбь','скорость','скот','скотина','скреп','скрипач','скрипка','скудо','скука','скутер','слава','слайд','след','следствие','слежка','слеза','слив','слива','слип','слиток','словарь','слово','слог','слой','слон','слониха','слот','слуга','служба','слух','случай','слюда','смазка','смак','смальта','смена','смеситель','смесь','сметана','смех','смола','смотр','смысл','смычок','снаряд','снаряжение','снег','снегирь','снеговик','снедь','сноп','собака','собес','соблазн','сова','совет','советница','совпадение','сода','соединение','сознание','сойка','сок','соке','сокол','солдат','солид','солист','соло','солод','солома','соломенка','солонка','соль','сольдо','сом','сомма','сомнение','сон','сона','сонар','соната','сообщение','соперник','сопло','сор','сорняк','сорока','сорт','сосед','сосиска','соска','сосок','состав','состояние','сота','соус','софа','соха','социалист','сочинение','союз','соя','спад','спазм','спас','спектакль','спектр','специалист','спешка','спина','спирт','спица','спокойствие','спонсор','спор','спорт','способ','справка','спрос','спутник','спутница','среда','срез','срок','ссора','ссылка','ставень','ставка','стадион','стаж','стаз','стакан','стан','станция','староста','старт','стая','ствол','створ','стежок','стеллаж','стена','стенка','степень','степс','степь','стержень','стерлядь','стилист','стиль','стирол','стих','стог','стоимость','стойка','стойкость','сток','стокс','стол','столб','столбец','столица','столяр','стоматолог','стон','стопа','стопка','сторож','сторона','стоя','стража','страна','страница','странник','страсть','страус','стрела','стрелка','стрельба','стремя','стройка','строка','стронций','строфа','стружка','струна','стручок','струя','студент','стук','стул','ступень','ступня','ступор','стыд','стык','стяг','су','субсидия','субстанция','субтитр','субъект','сувенир','сугроб','суд','сударь','судно','судьба','судья','суета','суи','сук','сука','сукно','сукре','сульфат','сульфид','сульфит','сум','сумка','сумма','сумо','сумоист','сундук','суп','сур','сура','сургуч','сурок','сурьма','сусек','суслик','сусло','сустав','суть','суфле','суфлёр','суффикс','суховей','суша','сфен','сфинкс','сцена','сценарий','сценарист','счастье','счёт','счётчик','счёты','считалка','съезд','съём','съёмка','сын','сыпь','сыр','сырник','сыроежка','сырок','сырт','сырьё','сыч','сыщик','сэндвич','сэр','сюжет','сюита','сюр','сюрприз','сюры','ся','табель','табес','таблетка','таблица','табло','табу','табурет','таз','тази','тазы','таи','тай','тайга','тайм','тайна','тайник','тайфун','тако','такси','такт','тактика','тал','талант','талия','таллий','тан','танец','танин','танк','тантал','тапки','тар','тара','таракан','тарелка','тариф','таро','тартар','тархун','тат','татами','тать','тау','тачка','таэль','тварь','твёрдо','тви','твид','творог','театр','тег','тегу','теза','тёзка','теин','тека','текст','текстура','телевизор','телега','телеграмма','телеграф','телескоп','телефон','теллур','тело','телятина','тем','тема','темп','темя','тенге','тени','теннессин','тенор','тент','тень','тео','теорема','теоретик','теория','тёпе','тепло','тербий','терем','тёрка','термин','термометр','тёрн','терпкость','тёс','тесак','тёска','тесо','тест','тесто','тесть','тета','тетерев','тетраборан','тетрадь','тетрамер','тётя','теург','тефлон','технеций','техник','техника','течение','течка','течь','тёша','тёща','тиара','тив','тигр','тигрёнок','тик','тильда','тина','тионил','тиоортофосфат','тиосульфат','тиоционат','тип','тир','тираж','тирамису','тире','тис','тиски','тит','титан','титанит','титр','титул','тиун','тиф','тишина','ткань','ткач','тлако','тлен','тление','тля','тмин','товар','товарищ','тога','тоди','той','тойя','ток','токарь','токи','токсин','тол','толк','толос','толпа','толчок','толщина','толь','том','томат','тон','тондо','тонкость','тонна','тонус','тоня','топ','топаз','топи','топик','топка','топо','тополь','топор','топот','топотня','топь','тор','торг','торговля','торец','торжество','торий','торо','торс','торт','торф','торшер','тоска','тотем','тоу','тоф','точка','трава','традиция','трак','трактат','трал','трамвай','трамплин','транс','трансляция','транспорт','транспортир','трап','трапеза','трапеция','трасса','трата','тревога','трек','тренажёр','тренер','трепак','треск','треска','треуголка','треугольник','трибуна','тример','триметилксантин','трио','триумф','тромб','трон','троп','тропа','тропики','трость','тротуар','трофей','трояк','труба','трубач','трубка','трубочист','труд','труп','труппа','трус','трусы','трущоба','трюк','трюфель','тряпка','тсуга','ту','туба','тугодум','туес','туз','тук','тул','туле','тулий','туман','тумба','тунец','тур','тура','тури','турист','турка','турне','турник','турнир','турок','тут','тута','тутор','туча','тучка','туш','туша','туше','тушение','тушь','туя','тхебе','тыква','тыл','тымф','тын','тынф','тье','тьма','тэк','тюб','тюк','тюлень','тюльпан','тюрьма','тяга','тяжесть','тям','убеждение','убийца','убой','убор','уборка','уборщик','уборщица','убыток','увар','увет','увечье','увоз','угар','угия','углерод','угол','уголь','угон','угроза','уд','уда','удав','удар','ударение','удача','удин','удой','удон','удочка','удэ','уезд','уж','ужас','ужастик','ужин','уза','узда','узел','узкость','узо','узор','узы','уйма','ук','указ','уки','уклад','уклон','укол','укор','укос','укроп','укрытие','уксус','укулеле','укус','улан','улар','улей','улит','улица','улов','ум','умник','умница','умора','унитаз','унт','унция','упаковка','упёк','уплата','упор','употребление','управа','управление','ураган','уран','урез','урезка','урна','урод','урожай','урок','урон','ус','усадьба','усик','условие','услуга','усол','успех','уста','устав','устои','устой','уступ','уступка','ут','утёс','утка','утоп','утро','утюг','уха','ухаб','ухват','ухо','уход','участок','учёба','учебник','ученик','ученица','учёт','учитель','учительница','ушиб','ушко','ушу','ущерб','уэд','уют','фа','фабрика','фавн','фавор','фаг','фагот','фаза','фазан','фай','файл','фак','факел','факолит','факт','фактор','факториал','фал','фамилия','фан','фанг','фант','фанта','фантик','фара','фарфор','фарш','фас','фасад','фасет','фасоль','фат','фата','фашизм','фашист','фаянс','фелс','фема','фен','фенил','фенол','феня','феод','ферзь','фермент','фермий','ферт','ферто','фертон','фестиваль','фет','фетр','фея','фи','фианит','фиаско','фига','фигура','фила','филе','философ','филс','фильм','фильтр','финал','финик','финиш','финт','фио','фипа','фирма','фитиль','фишка','флаг','флагшток','флакон','флан','флеровий','флот','фляга','фоб','фобия','фойе','фок','фокус','фокусник','фол','фолио','фолия','фольга','фольклор','фом','фон','фонарик','фонарь','фонд','фондю','фонограф','фонон','фонтан','фор','фора','форе','форель','форма','формат','формула','форро','форт','форте','фортепиано','форточка','форум','фосфид','фот','фото','фотограф','фотография','фотон','фра','фраза','франк','франций','фрезер','фреон','фронтон','фрукт','фтор','фторид','фу','фуа','фуга','фугу','фук','функция','фунт','фур','фура','фуражка','фургон','фуро','фурор','фут','фута','футболка','фуэте','фынь','фырк','фьючерс','фюнфер','ха','хаджи','хаз','хайку','хайло','хала','халал','халва','халк','хан','ханша','хань','хао','хаос','характер','характеристика','хассий','хастл','хата','хаус','хворост','хвост','хвоя','хе','хек','хер','хет','хетт','хеш','хижина','хин','хинон','хиппи','хит','хлам','хлеб','хлипкость','хлопок','хлор','хлорат','хлорид','хлорит','хлыст','хлюст','хмель','хна','хо','хобби','хобот','ход','хода','ходьба','хозяин','хой','хока','холера','холм','холод','холодец','холодильник','холуй','хомяк','хон','хор','хора','хорал','хорда','хоругвь','хорь','хота','хоу','хохма','хохот','храм','хранение','храп','хребет','хрен','хризантема','хрип','хрипота','хром','хромат','хроника','хронология','хрупкость','хруст','хрусталь','хрущ','хрящ','хутор','цам','цапля','царь','цвет','цветок','цевка','цедра','цеж','цезий','цек','цель','цемент','цена','цензор','цензура','цент','центр','цеп','цепкость','цепь','церий','церковь','церь','цех','цеце','цзяо','ци','цианид','цикл','циклон','цилиндр','цинга','цинк','цинь','цирк','цирконий','циркуль','цистерна','цитата','циферт','цифра','цоколь','цокот','цоу','цук','цукат','цы','цыган','цыплёнок','цянь','чабан','чад','чадо','чай','чайка','чал','чан','чардаш','час','частица','часть','часы','чат','чатни','чача','чаша','чашка','чаща','чворак','чек','чека','чекан','чело','человек','чемодан','чепуха','червь','червяк','чердак','черёд','череда','череп','черепаха','черепок','чернь','черпак','чёрт','черта','чертёж','чесание','чеснок','чесотка','честь','чёт','чета','чёткость','четь','чехол','чечевица','чечётка','чечня','чиж','чий','чили','чилим','чин','чина','чинар','чип','чир','число','чистка','чистота','чих','член','чон','чоор','чоп','чтение','чтец','чтиво','чугун','чудак','чудо','чужда','чулан','чум','чур','чуткость','чутьё','чучело','чушь','ша','шаг','шадуф','шайба','шайка','шалаш','шале','шалун','шаль','шаман','шамот','шампунь','шанс','шантаж','шань','шапка','шар','шарах','шарик','шарм','шарф','шато','шаттл','шаурма','шах','шахта','шахтёр','шве','швед','швея','шви','шед','шедевр','шедула','шез','шездор','шекель','шелест','шёлк','шеляг','шем','шен','шенк','шёпот','шерф','шест','шеф','шея','ши','шиворот','шик','шиллинг','шило','шина','шип','шир','ширина','ширма','широта','ширь','шихта','шишка','шкаф','шкив','шкода','школа','шкура','шлак','шланг','шлейф','шлем','шликер','шлюз','шляпа','шмель','шнек','шнур','шнурок','шов','шок','шокер','шоколад','шона','шор','шора','шорох','шоссе','шоттиш','шоу','шофёр','шпик','шпиль','шпион','шпионаж','шпора','шприц','шпунт','шрифт','штаб','штамп','штат','штатив','штиль','штифт','штора','штраф','штрих','штук','штука','штурвал','штурм','шу','шуб','шуба','шугай','шум','шунт','шуруп','шут','шутка','шутник','шэ','шэд','шэн','ща','щавель','щебень','щебет','щека','щёкот','щёлк','щёлка','щель','щенок','щепа','щепка','щепоть','щербет','щётка','щи','щит','щиток','щука','щуп','щупальце','щур','ыр','эбонит','эбру','эве','эвен','эго','эгоизм','эгоист','эде','эйнштейний','эйре','экзамен','экипаж','эклер','экран','эксперт','экю','элемент','эллипс','эль','эльф','эмблема','эмигрант','эмоция','эму','эмулятор','энджел','эндшпиль','энергия','энрик','эозин','эон','эпиграф','эпидот','эпизод','эпилог','эпистрофа','эпод','эполет','эпос','эпоха','эпсилон','эра','эрбий','эре','эротика','эртген','эртли','эртуг','эрудит','эскиз','эскимо','эссе','эстет','эстрада','эта','этаж','этан','этанол','этап','этил','этюд','эфа','эфиопия','эфир','эффект','эхо','юань','юг','юга','югра','юз','юко','юла','юмор','юнайт','юнга','юникорн','юнкор','юность','юноша','юпа','юра','юрист','юрт','юрта','юс','ют','юты','юхта','юц','юэ','ябеда','ябиру','яблоко','яблоня','явка','явление','явор','явь','яга','ягнёнок','ягода','ягуар','яд','ядро','язык','язь','яичница','яйцо','як','яке','яки','якорь','якут','ял','ям','яма','ямб','ямка','ямс','ямщик','ямь','ян','янки','янтарь','яо','яп','яппи','яр','яранга','ярд','ярка','яркость','ярлык','ярмарка','ярмо','ярость','ярунок','ярус','ярь','яс','ясли','ять','яхта','ячейка','ячмень','яшма','ящер','ящерица','ящик','ящур']
const gameHTML = document.getElementsByClassName('game')[0]
const boardHTML = document.getElementsByClassName('board')[0]
const madeWordsHTML = document.getElementsByClassName('made_words')[0]
const messagesHTML = document.getElementsByClassName('messages')[0]
const bonusCoords = [
    [3,11,36,38,45,52,59,92,96,98,102,108,116,122,126,128,132,165,172,179,186,188,213,221], //double letter
    [20,24,76,88,136,148,200,204], //triple letter
    [16,28,32,42,48,56,64,70,154,160,168,176,182,192,196,208], //double word
    [0,7,14,105,119,210,217,224] //triple word
]
const bonusColors = [
    '#A7BA75', '#E5D27E', '#A7BCCA', '#E57D6F'
]

let boardArray = []; for(let c=0; c<225; c++) boardArray.push(' ')
let myScore = 0

for(let x=0;x<15;x++){
    for(let y=0;y<15;y++){
        let cell = document.createElement('div')
        cell.className = 'cell'
        cell.style.position = 'absolute'
        cell.style.left = x*32+6
        cell.style.top = y*32+6
        for(let i=0;i<4;i++){
            if(bonusCoords[i].includes(x+y*15)){
            cell.style.backgroundColor = bonusColors[i]
        }}
        boardHTML.appendChild(cell);
    }
}

function dragElement(tile) {
    let pos1 = 0, pos2 = 0, pos3 = 0, pos4 = 0;
    if (document.getElementById(tile.element.id + "header")) {
        // if present, the header is where you move the DIV from:
        document.getElementById(tile.element.id + "header").onmousedown = dragMouseDown;
    } else {
        // otherwise, move the DIV from anywhere inside the DIV:
        tile.element.onmousedown = dragMouseDown;
    }

    function dragMouseDown(e) {
        tile.previousX = tile.element.style.left
        tile.previousY = tile.element.style.top
        tile.element.style.zIndex = '400'
        e = e || window.event;
        e.preventDefault();
        // get the mouse cursor position at startup:
        pos3 = e.clientX;
        pos4 = e.clientY;
        document.onmouseup = closeDragElement;
        // call a function whenever the cursor moves:
        document.onmousemove = elementDrag;
    }

    function elementDrag(e) {
        if(!tile.onBoard){
            e = e || window.event;
            e.preventDefault();
            // calculate the new cursor position:
            pos1 = pos3 - e.clientX;
            pos2 = pos4 - e.clientY;
            pos3 = e.clientX;
            pos4 = e.clientY;
            // set the element's new position:
            tile.element.style.left = (tile.element.offsetLeft - pos1) + "px";
            tile.element.style.top = (tile.element.offsetTop - pos2) + "px";
        }
    }

    function closeDragElement() {
        // stop moving when mouse button is released:
        document.onmouseup = null;
        document.onmousemove = null;
        tile.element.style.zIndex = 'auto'
        if(parseInt(tile.element.style.left.slice(0,-2)) > 296) {
            tile.element.style.left = Math.floor((tile.element.offsetLeft - pos1 - 25)/32+.5)*32+25 + "px";
            tile.element.style.top = Math.floor((tile.element.offsetTop - pos2 - 13)/32+.5)*32+13 + "px";
            
            for(let t=0;t<myTiles.length;t++){
                if(myTiles[t].element.style.left == tile.element.style.left
                && myTiles[t].element.style.top == tile.element.style.top
                && myTiles[t]!=tile){
                    myTiles[t].element.style.left = tile.previousX
                    myTiles[t].element.style.top  = tile.previousY
                }
            }
            for(let t=0;t<boardTiles.length;t++){
                if(boardTiles[t].element.style.left == tile.element.style.left
                && boardTiles[t].element.style.top == tile.element.style.top){
                    tile.element.style.left = tile.previousX
                    tile.element.style.top = tile.previousY
                }
            }
        }
    }
}

const alpha  = 'абвгдежзийклмнопрстуфхцчшщъыьэюя*'.split('')
const point  = [1,3,1,3,2,1,5,5,1,4,2,2,2,1, 1,2,1,1,1,2,8,5,5,5,8,10,15,4,3,8,8,3]
const amount = [8,2,4,2,4,9,1,2,6,1,4,4,3,5,10,4,5,5,5,4,1,1,1,1,1, 1, 1,2,2,1,1,2,3]

class Tile{
    element = undefined;
    constructor(x, y, letter, onBoard=false){
        let tileIndex = alpha.indexOf(letter)
        this.onBoard = onBoard;
        this.previousX =  x.toString()+'px'
        this.previousY =  y.toString()+'px'
        this.element = document.createElement('div')
        this.element.className = 'tile'
        this.element.innerHTML = tileIndex<32 ? `<div class="letter">${alpha[tileIndex]}</div> <div class="point">${point[tileIndex]}</div>` : `<div class="star"> <img src="star.svg" width="20" height="20" ></img><div class="letter star_letter"></div></div>`
        this.element.style.position = 'absolute'
        if(!onBoard) this.element.style.cursor = 'move'
        this.element.style.left = x.toString()+'px'
        this.element.style.top = y.toString()+'px'
        gameHTML.appendChild(this.element);
        dragElement(this);
    }

    destroy(){
        this.element.remove()
    }
}

let currentAmount = [...amount]
let myTiles = []
let boardTiles = []
takeTilesForRack()

function takeTilesForRack(){
    for(t=0;t<myTiles.length;t++){
        myTiles[t].element.style.left=93+t*30
        myTiles[t].element.style.top=375
    }
    while(myTiles.length<7){
        let tilesLeft = 0
        for(let i=0;i<amount.length;i++){
            tilesLeft+=currentAmount[i]
        } 
        if(tilesLeft>0){
            let randomTile = Math.floor(Math.random()*tilesLeft)
            let tileIndex=0
            while(randomTile>=currentAmount[tileIndex]){
                randomTile-=currentAmount[tileIndex]
                tileIndex++
            }
            myTiles.push(new Tile(93+myTiles.length*30,375,alpha[tileIndex]))
            currentAmount[tileIndex]--;
            tilesLeft--
        }else{
            break
        }
        tilesLeftString = getPuralWord(['фишка','фишки','фишек'],tilesLeft).split(' ')
        tilesLeftString[0] = `<big_number>${tilesLeftString[0]}</big_number>`
        tilesLeftString = tilesLeftString.join('<br>')
        document.getElementsByClassName('tiles_box_inner')[0].innerHTML = tilesLeftString
    }
}

function declareStar(element){
    /*
    const pointerHTML = document.getElementsByClassName('pointer')[0]
    let x = parseInt(element.style.left.slice(0,-2)) - 313
    let y = parseInt(element.style.top.slice(0,-2)) - 13
    pointerHTML.style.left = 307+x
    pointerHTML.style.top = 7+y
    pointerHTML.style.visibility = 'visible'
    const letterChooseHTML = document.getElementsByClassName('choosing_letter_for_star')[0]
    letterChooseHTML.style.left = Math.min(parseInt(pointerHTML.style.left.slice(0,-2))-156,448)
    letterChooseHTML.style.top = parseInt(pointerHTML.style.top.slice(0,-2))+47
    if(parseInt(letterChooseHTML.style.top.slice(0,-2)) > 420)
    letterChooseHTML.style.top = parseInt(pointerHTML.style.top.slice(0,-2))-108
    letterChooseHTML.style.visibility  = 'visible'
    for(l=0;l<letterChooseHTML.getElementsByClassName('tile').length;l++){
        let letterHTML = letterChooseHTML.getElementsByClassName('tile')[l].getElementsByClassName('letter')[0].innerText
        letterChooseHTML.getElementsByClassName('tile')[l].addEventListener('click', function(){chooseLetter(letterHTML)}, false)
    }
    function chooseLetter(letter){
        //element.getElementsByClassName('letter')[0].innerText=letter
        element.innerHTML=`<div class="star_with_letter"> <img src="star.svg"><div class="letter star_letter">${letter}</div></div>`
        for(l=0;l<letterChooseHTML.getElementsByClassName('tile').length;l++){
            letterChooseHTML.getElementsByClassName('tile')[l].removeEventListener('click', chooseLetter, false)
        }
        pointerHTML.style.visibility        = 'hidden'
        letterChooseHTML.style.visibility   = 'hidden'

    }*/
    console.log('star is not scripetd yet\nдля звёздочки код не написан')
}

document.getElementById('clear_button').onclick = function(){
    for(t=0;t<myTiles.length;t++){
        myTiles[t].element.style.left=93+t*30
        myTiles[t].element.style.top=375
    }
}

function sendAnswer(){
    for(let t=6;t>=0;t--){
        if(parseInt(myTiles[t].element.style.left.slice(0,-2))>296){
            myTiles[t].onBoard = true
            myTiles[t].element.style.cursor = 'auto';
            boardTiles.push(myTiles[t])
            myTiles.splice(t,1)
        }
    }
    takeTilesForRack()
}

document.getElementById('send_button').onclick = function(){
    let newBoardArray = [...boardArray]
    let newBoardTiles = []
    for(t=0;t<myTiles.length;t++){
        if(parseInt(myTiles[t].element.style.left.slice(0,-2))>296){
            let x = (parseInt(myTiles[t].element.style.left.slice(0,-2))-313)/32
            let y = (parseInt(myTiles[t].element.style.top.slice(0,-2))-13)/32
            let letter = myTiles[t].element.getElementsByClassName('letter')[0].innerText
            if(letter!='') {
                newBoardArray[x+y*15] = myTiles[t].element.getElementsByClassName('letter')[0].innerText
                newBoardTiles.push(x+y*15)
            } else {
                declareStar(myTiles[t].element)
            }
        }
    }
    let allTilesConnected = true
    if(newBoardArray[112]!=' '){
        for(let c=0;c<225;c++){
            if(newBoardArray[c]!=' '){
                let connected = false
                if(c>=15    && newBoardArray[c-15]!=' ') connected = true
                if(c%15!=0  && newBoardArray[c- 1]!=' ') connected = true
                if(c<=210   && newBoardArray[c+15]!=' ') connected = true
                if(c%15!=14 && newBoardArray[c+ 1]!=' ') connected = true
                if(!connected){
                    allTilesConnected = false
                    break
                }
            }
        }
    }else{
        allTilesConnected = false
    }
    if(allTilesConnected){
        let wordsAndCoords = []
        let areAllWordsValid = true
        let wordsNotFound = []
        for(t=0;areAllWordsValid && t<newBoardTiles.length;t++){
            // x
            let word = newBoardArray[newBoardTiles[t]]
            let offset = 1
            let coords = [newBoardTiles[t]] 
            while(newBoardArray[newBoardTiles[t]-offset]!=' ' && (newBoardTiles[t]-offset)%15!=14){
                word = newBoardArray[newBoardTiles[t]-offset] + word
                coords.unshift(newBoardTiles[t]-offset)
                offset++
            }
            offset = 1
            while(newBoardArray[newBoardTiles[t]+offset]!=' ' && (newBoardTiles[t]+offset)%15!=0){
                word = word + newBoardArray[newBoardTiles[t]+offset]
                coords.push(newBoardTiles[t]+offset)
                offset++
            }
            if(word.length>1){
                let wordIndex = wordList.map(_w => {while(_w.includes('ё')) _w=_w.replace('ё','е'); return _w;}).indexOf(word)
                if(wordIndex!=-1){
                    let wordAndCoord = [wordList[wordIndex], coords[0], coords[1]-coords[0]];
                    if(!wordsAndCoords.map(a => JSON.stringify(a)).includes(JSON.stringify(wordAndCoord))){
                        wordsAndCoords.push(wordAndCoord)
                    }
                } else {
                    areAllWordsValid = false
                    wordsNotFound.push(word)
                }
            }
            // y
            word = newBoardArray[newBoardTiles[t]]
            offset = 1
            coords = [newBoardTiles[t]] 
            while(newBoardArray[newBoardTiles[t]-offset*15]!=' ' && newBoardTiles[t]-offset*15>0){
                word = newBoardArray[newBoardTiles[t]-offset*15] + word
                coords.unshift(newBoardTiles[t]-offset*15)
                offset++
            }
            offset = 1
            while(newBoardArray[newBoardTiles[t]+offset*15]!=' ' && newBoardTiles[t]+offset*15<225){
                word = word + newBoardArray[newBoardTiles[t]+offset*15]
                coords.push(newBoardTiles[t]+offset*15)
                offset++
            }
            if(word.length>1){
                let wordIndex = wordList.map(_w => {while(_w.includes('ё')) _w=_w.replace('ё','е'); return _w; }).indexOf(word)
                if(wordIndex!=-1){
                    let wordAndCoord = [wordList[wordIndex], coords[0], coords[1]-coords[0]];
                    if(!wordsAndCoords.map(a => JSON.stringify(a)).includes(JSON.stringify(wordAndCoord))){
                        wordsAndCoords.push(wordAndCoord)
                    }
                } else {
                    areAllWordsValid = false
                    wordsNotFound.push(word)
                }
            }
            if(wordsNotFound.length>0)
                showMessage(`<words_not_found>${getPuralWord(['слово','слова','слов'], wordsNotFound.length)} не найдено в словаре:</words_not_found><br><invalid_words>${wordsNotFound.map(_w => capitalizeFirstLetter(_w)).join('<br>')}</invalid_words>`)
        }
        if(areAllWordsValid) {
            let points = 0
            let wordsAndPoints = []
            for(w=0;w<wordsAndCoords.length;w++){
                let wordPoints = 0
                let wordMultiplier = 1
                for(let l=0; l<wordsAndCoords[w][0].length; l++){
                    let letterMultiplier = 1
                         if(bonusCoords[0].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) letterMultiplier *= 2
                    else if(bonusCoords[1].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) letterMultiplier *= 3
                    else if(bonusCoords[2].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) wordMultiplier *= 2
                    else if(bonusCoords[3].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) wordMultiplier *= 3
                    let letter = wordsAndCoords[w][0][l]
                    if(letter=='ё') letter='е'
                    wordPoints += point[alpha.indexOf(letter)] * letterMultiplier
                }
                wordPoints *= wordMultiplier
                let wordAndPointIndex = wordsAndPoints.map(w => w[0]).indexOf(wordsAndCoords[w][0])
                if(wordAndPointIndex==-1) {
                    wordsAndPoints.push([wordsAndCoords[w][0], wordPoints])
                    points += wordPoints
                } else {
                    points -= wordsAndPoints[wordAndPointIndex][1]
                    wordsAndPoints[wordAndPointIndex][1] = Math.max(wordsAndPoints[wordAndPointIndex][1], wordPoints)
                    points += wordsAndPoints[wordAndPointIndex][1]
                }
            }
            if(newBoardTiles.length==7){
                wordsAndPoints.push(['за все фишки', 15])
                points += 15
            }
            
            sendAnswer()
            boardArray = [...newBoardArray]
            myScore += points
            document.getElementsByClassName('your_score')[0].innerHTML = `Очки: <b>${myScore}</b>`
            for(let w=0; w<wordsAndPoints.length; w++){
                let row = document.getElementsByClassName('made_words_table')[0].insertRow()
                row.insertCell(0).innerHTML = w==0 ? 'P1': ''
                row.insertCell(1).innerHTML = wordsAndPoints[w][1]
                row.insertCell(2).innerHTML = capitalizeFirstLetter(wordsAndPoints[w][0])
            }
            madeWordsHTML.scrollTop = madeWordsHTML.scrollHeight
        }
    }
}

document.getElementById('check_button').onclick = function(){
    let newBoardArray = [...boardArray]
    let newBoardTiles = []
    for(t=0;t<myTiles.length;t++){
        if(parseInt(myTiles[t].element.style.left.slice(0,-2))>296){
            let x = (parseInt(myTiles[t].element.style.left.slice(0,-2))-313)/32
            let y = (parseInt(myTiles[t].element.style.top.slice(0,-2))-13)/32
            let letter = myTiles[t].element.getElementsByClassName('letter')[0].innerText
            if(letter!='') {
                newBoardArray[x+y*15] = myTiles[t].element.getElementsByClassName('letter')[0].innerText
                newBoardTiles.push(x+y*15)
            } else {
                declareStar(myTiles[t].element)
            }
        }
    }
    let allTilesConnected = true
    if(newBoardArray[112]!=' '){
        for(let c=0;c<225;c++){
            if(newBoardArray[c]!=' '){
                let connected = false
                if(c>=15    && newBoardArray[c-15]!=' ') connected = true
                if(c%15!=0  && newBoardArray[c- 1]!=' ') connected = true
                if(c<=210   && newBoardArray[c+15]!=' ') connected = true
                if(c%15!=14 && newBoardArray[c+ 1]!=' ') connected = true
                if(!connected){
                    allTilesConnected = false
                    break
                }
            }
        }
    }else{
        allTilesConnected = false
    }
    if(allTilesConnected){
        let wordsAndCoords = []
        let areAllWordsValid = true
        let wordsNotFound = []
        for(t=0;areAllWordsValid && t<newBoardTiles.length;t++){
            // x
            let word = newBoardArray[newBoardTiles[t]]
            let offset = 1
            let coords = [newBoardTiles[t]] 
            while(newBoardArray[newBoardTiles[t]-offset]!=' ' && (newBoardTiles[t]-offset)%15!=14){
                word = newBoardArray[newBoardTiles[t]-offset] + word
                coords.unshift(newBoardTiles[t]-offset)
                offset++
            }
            offset = 1
            while(newBoardArray[newBoardTiles[t]+offset]!=' ' && (newBoardTiles[t]+offset)%15!=0){
                word = word + newBoardArray[newBoardTiles[t]+offset]
                coords.push(newBoardTiles[t]+offset)
                offset++
            }
            if(word.length>1){
                let wordIndex = wordList.map(_w => {while(_w.includes('ё')) _w=_w.replace('ё','е'); return _w;}).indexOf(word)
                if(wordIndex!=-1){
                    let wordAndCoord = [wordList[wordIndex], coords[0], coords[1]-coords[0]];
                    if(!wordsAndCoords.map(a => JSON.stringify(a)).includes(JSON.stringify(wordAndCoord))){
                        wordsAndCoords.push(wordAndCoord)
                    }
                } else {
                    areAllWordsValid = false
                    wordsNotFound.push(word)
                }
            }
            // y
            word = newBoardArray[newBoardTiles[t]]
            offset = 1
            coords = [newBoardTiles[t]] 
            while(newBoardArray[newBoardTiles[t]-offset*15]!=' ' && newBoardTiles[t]-offset*15>0){
                word = newBoardArray[newBoardTiles[t]-offset*15] + word
                coords.unshift(newBoardTiles[t]-offset*15)
                offset++
            }
            offset = 1
            while(newBoardArray[newBoardTiles[t]+offset*15]!=' ' && newBoardTiles[t]+offset*15<225){
                word = word + newBoardArray[newBoardTiles[t]+offset*15]
                coords.push(newBoardTiles[t]+offset*15)
                offset++
            }
            if(word.length>1){
                let wordIndex = wordList.map(_w => {while(_w.includes('ё')) _w=_w.replace('ё','е'); return _w; }).indexOf(word)
                if(wordIndex!=-1){
                    let wordAndCoord = [wordList[wordIndex], coords[0], coords[1]-coords[0]];
                    if(!wordsAndCoords.map(a => JSON.stringify(a)).includes(JSON.stringify(wordAndCoord))){
                        wordsAndCoords.push(wordAndCoord)
                    }
                } else {
                    areAllWordsValid = false
                    wordsNotFound.push(word)
                }
            }
            if(wordsNotFound.length>0)
                showMessage(`<words_not_found>${getPuralWord(['слово','слова','слов'], wordsNotFound.length)} не найдено в словаре:</words_not_found><br><invalid_words>${wordsNotFound.map(_w => capitalizeFirstLetter(_w)).join('<br>')}</invalid_words>`)
        }
        if(areAllWordsValid) {
            let points = 0
            let wordsAndPoints = []
            for(w=0;w<wordsAndCoords.length;w++){
                let wordPoints = 0
                let wordMultiplier = 1
                for(let l=0; l<wordsAndCoords[w][0].length; l++){
                    let letterMultiplier = 1
                         if(bonusCoords[0].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) letterMultiplier *= 2
                    else if(bonusCoords[1].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) letterMultiplier *= 3
                    else if(bonusCoords[2].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) wordMultiplier *= 2
                    else if(bonusCoords[3].includes(wordsAndCoords[w][1]+wordsAndCoords[w][2]*l)) wordMultiplier *= 3
                    let letter = wordsAndCoords[w][0][l]
                    if(letter=='ё') letter='е'
                    wordPoints += point[alpha.indexOf(letter)] * letterMultiplier
                }
                wordPoints *= wordMultiplier
                let wordAndPointIndex = wordsAndPoints.map(w => w[0]).indexOf(wordsAndCoords[w][0])
                if(wordAndPointIndex==-1) {
                    wordsAndPoints.push([wordsAndCoords[w][0], wordPoints])
                    points += wordPoints
                } else {
                    points -= wordsAndPoints[wordAndPointIndex][1]
                    wordsAndPoints[wordAndPointIndex][1] = Math.max(wordsAndPoints[wordAndPointIndex][1], wordPoints)
                    points += wordsAndPoints[wordAndPointIndex][1]
                }
            }
            if(newBoardTiles.length==7){
                wordsAndPoints.push(['за все фишки', 15])
                points += 15
            }

            showMessage(`<move_gives_points>Этот ход даст вам ${getPuralWord(['очко','очка','очков'], points)}</move_gives_points>`)
        }
    }
}

function getPuralWord(words, number){
    let column = 2
    if(number%100<5 || number%100>20){
        if(number%10==1){
            column = 0
        }else if(number%10>1 && number%10<5){
            column = 1
        }  
    }
    return `${number} ${words[column]}`
}

function capitalizeFirstLetter(word){
    return word.charAt(0).toUpperCase() + word.slice(1);
}

function showMessage(message){
    let element = document.createElement('div')
    element.className = 'message'
    element.innerHTML = message+'<a class="close_button">Закрыть</a>'
    element.style.zIndex = '800'
    element.getElementsByClassName('close_button')[0].addEventListener('click', function(){closeMessage(element)}, false)
    messagesHTML.appendChild(element)
}

function closeMessage(element){
    element.remove()
}

class Game{
    constructor(players, scoreTarget=200){
        this.players = players
        this.scoreTarget = scoreTarget
        this.playerTiles = []; for(let p=0;p<this.players.length;p++) this.playerTiles[p]=[]
        this.score = []; for(let p=0;p<this.players.length;p++) this.score[p] = 0
        this.board = []; for(let c=0;c<225;c++) this.board[c]=' '
        this.starCells = []
        this.usedWords = []
        this.playerTurn = 0
        this.timer = 120
    }

    open(curretPlayerIndex=0){
        for(let t=0;t<boardTiles.length;t++) boardTiles[t].destroy()
        for(let t=0;t<myTiles.length;t++) myTiles[t].destroy()
        for(let c=0;c<225;c++) {
            if(this.board[c]!=' '){
                if(!this.starCells.includes(c)){
                    let x = c%15
                    let y = (c-c%15)/15
                    boardTiles.push(new Tile(313+32*x,13+32*y, board[c]), true)
                }else{
                    declareStar(myTiles[t].element)
                }
            }
        }
        let currentPlayerTiles = playerTiles[curretPlayerIndex]
        for(let t=0;t<currentPlayerTiles;t++){
            myTiles.push(new Tile(93+myTiles.length*30,375,currentPlayerTiles[t]))
        }
    }
}

class Player{
    constructor(name, chips, avatar='noPhotoPlayer.png'){
        this.name = name
        this.chips = chips
        this.avatar = avatar
    }
}